-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: localhost    Database: music
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `artists`
--

DROP TABLE IF EXISTS `artists`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `artists` (
  `ArtistID` char(4) NOT NULL,
  `ArtistName` text NOT NULL,
  PRIMARY KEY (`ArtistID`),
  UNIQUE KEY `SingerID_UNIQUE` (`ArtistID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `artists`
--

LOCK TABLES `artists` WRITE;
/*!40000 ALTER TABLE `artists` DISABLE KEYS */;
INSERT INTO `artists` VALUES ('p000','无'),('p001','苏打绿'),('p002','凤凰传奇'),('p003','周杰伦'),('p004','李宇春'),('p005','张学友'),('p006','五月天'),('p007','黑鸭子演唱组'),('p008','张靓颖'),('p009','伍佰 & China Blue'),('p010','王菀之'),('p011','于莎莎'),('p012','派伟俊'),('p013','张含韵'),('p014','张杰'),('p015','图拉'),('p016','syE_21'),('p017','郭富城'),('p018','王麟'),('p019','吴昕'),('p020','任素汐'),('p021','温岚'),('p022','王心凌'),('p023','陈奕迅'),('p024','刘岩'),('p025','关正杰'),('p026','汤潮'),('p027','Ariana Grande'),('p028','王智'),('p029','水木年华'),('p030','曹芙嘉'),('p031','阿尔法'),('p032','蒋志光'),('p033','刘德华'),('p034','陈洁仪'),('p035','刘若英'),('p036','金美儿'),('p037','王丽坤'),('p038','毛不易'),('p039','G.E.M. 邓紫棋'),('p040','赵今麦'),('p041','易铭'),('p042','王俊凯'),('p043','王杰'),('p044','蔡枫华'),('p045','小六'),('p046','王菲'),('p047','林志炫'),('p048','周云蓬'),('p049','TF家族-穆祉丞'),('p050','刘全和'),('p051','马兰花'),('p052','叶蒨文'),('p053','林俊杰'),('p054','那英'),('p055','梅艳芳'),('p056','王力宏'),('p057','Ella陈嘉桦'),('p058','林珈含'),('p059','许钧'),('p060','韦绮姗'),('p061','田馥甄'),('p062','郑中基'),('p063','邝美云'),('p064','张国荣'),('p065','苏永康'),('p066','K\'naan'),('p067','费玉清'),('p068','高慧君'),('p069','庾澄庆'),('p070','成龙'),('p071','陈淑桦'),('p072','Free 9'),('p073','小精灵'),('p074','阿鲁阿卓'),('p075','赵楚纶'),('p076','潘玮柏'),('p077','钟立风'),('p078','Lara梁心颐'),('p079','五月天 阿信'),('p080','刘思良'),('p081','CoCo李玟'),('p082','林子祥'),('p083','萧敬腾'),('p084','华晨宇'),('p085','贰佰'),('p086','达布希勒图'),('p087','Priscilla Ahn'),('p088','赵大紫'),('p089','易烊千玺'),('p090','罗志祥'),('p091','丁当'),('p092','刘姝麟'),('p093','MC赵小涣'),('p094','郁可唯'),('p095','伊能静'),('p096','小娟&山谷里的居民'),('p097','三十位素人'),('p098','李健'),('p099','TF家族-陈天润'),('p100','Jeffrey董又霖'),('p101','张震岳'),('p102','杨光'),('p103','海陆'),('p104','陈慧娴'),('p105','郑伊健'),('p106','小沈阳'),('p107','张智霖'),('p108','李克勤'),('p109','吕薇'),('p110','华语群星'),('p111','许秋怡'),('p112','周炜'),('p113','陈梓童'),('p114','刘嘉玲'),('p115','光良'),('p116','宁静'),('p117','TF家族-左航'),('p118','刘一扬'),('p119','张萌'),('p120','李幸倪'),('p121','许志安'),('p122','罗文'),('p123','许飞'),('p124','任贤齐'),('p125','齐秦'),('p126','黄圣依'),('p127','蔡依林'),('p128','童安格'),('p129','张鑫'),('p130','浪花兄弟'),('p131','李玲玉'),('p132','阿朵'),('p133','朱婧汐Akini Jing'),('p134','甄妮'),('p135','郑希怡'),('p136','王源'),('p137','MC HotDog 热狗'),('p138','房东的猫'),('p139','袁咏琳'),('p140','周兴才让'),('p141','Jinx周'),('p142','丢火车乐队'),('p143','LOKEY低调组合'),('p144','丁于'),('p145','庄达菲'),('p146','余味无穷'),('p147','汤宝如'),('p148','黎明'),('p149','SNH48'),('p150','严爵'),('p151','阿达娃'),('p152','陈绮贞'),('p153','黄静美'),('p154','徐小凤'),('p155','李硕'),('p156','汪正正'),('p157','TF家族-余宇涵'),('p158','汪峰'),('p159','李荣浩'),('p160','林仟淇'),('p161','林姗姗'),('p162','李明霖'),('p163','许鹤缤'),('p164','林迈可'),('p165','蔡国权'),('p166','许茹芸'),('p167','胡月'),('p168','杨瑞代'),('p169','王雅文'),('p170','TF家族-朱志鑫'),('p171','徐静雨'),('p172','张韶涵'),('p173','赵星'),('p174','李安'),('p175','TF家族-姚昱辰'),('p176','黄渤'),('p177','萧秉治'),('p178','郑秀文'),('p179','风子'),('p180','刘欢'),('p181','刘莉旻'),('p182','TF家族-邓佳鑫'),('p183','马郁'),('p184','潘越云'),('p185','关诗敏'),('p186','黎瑞恩'),('p187','万晓利'),('p188','李艳恰+刘洋'),('p189','钟镇涛'),('p190','YC'),('p191','金莎'),('p192','TF家族-童禹坤'),('p193','周华健'),('p194','阿木古楞'),('p195','刘劲'),('p196','法老'),('p197','张苗苗'),('p198','潘儿'),('p199','张惠妹'),('p200','钟丽缇'),('p201','谭咏麟'),('p202','彭羚'),('p203','周慧敏'),('p204','徐千雅'),('p205','陈美玲'),('p206','蓝盈莹'),('p207','TFBOYS'),('p208','董雪一家'),('p209','阿梨粤'),('p210','周润发'),('p211','雷佳'),('p212','Glay'),('p213','阿哲'),('p214','王淑瑶'),('p215','孙燕姿'),('p216','乌兰图雅'),('p217','毛阿敏'),('p218','宝石Gem'),('p219','谷村新司'),('p220','筷子兄弟'),('p221','艾敬'),('p222','黄龄'),('p223','王祖蓝'),('p224','斯琴高丽'),('p225','好妹妹'),('p226','告五人'),('p227','舒克'),('p228','TF家族-张峻豪'),('p229','叶振棠'),('p230','张雨绮'),('p231','小河与寻谣计划'),('p232','王旭《旭日阳刚》'),('p233','赵尔玲'),('p234','刘芸'),('p235','TF家族-苏新皓'),('p236','草蜢'),('p237','孜克肉拉木?艾尼'),('p238','谢霆锋'),('p239','刘小慧'),('p240','沈梦辰'),('p241','吕方'),('p242','赵冠羽'),('p243','蒋先贵'),('p244','Kobe Bryant'),('p245','齐豫'),('p246','周影'),('p247','关淑怡'),('p248','赵学而'),('p249','豆包'),('p250','韩红'),('p251','李鑫一'),('p252','陈知远'),('p253','TF家族-张极'),('p254','白冰'),('p255','陶喆'),('p256','陈松伶'),('p257','马条'),('p258','周启生'),('p259','李斯丹妮'),('p260','万茜'),('p261','邓丽君'),('p262','张家辉'),('p263','张羽'),('p264','彭席彦'),('p265','张若水'),('p266','金波'),('p267','Soler'),('p268','S.H.E'),('p269','柳爽'),('p270','钟皓天'),('p271','黄凯芹'),('p272','金晨'),('p273','孟佳'),('p274','欧丁玉'),('p275','羽田'),('p276','何炅'),('p277','邓超'),('p278','TF家族-张泽禹'),('p279','王霏霏'),('p280','Pada'),('p281','平安'),('p282','玖月奇迹'),('p283','刘全利');
/*!40000 ALTER TABLE `artists` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-11 18:04:30
